Wendellee/2024-Electronics-Competition/code/MSP432_RLC_Monitor/source/button.h
#include "ti/devices/msp432e4/driverlib/driverlib.h"

#define BUTTON1_PIN GPIO_PIN_0
#define BUTTON2_PIN GPIO_PIN_1

#define Switch1_GPIO_Port    GPIO_PORTA_BASE
#define Switch2_GPIO_Port    GPIO_PORTD_BASE
#define Switch3_GPIO_Port    GPIO_PORTC_BASE
#define Switch4_GPIO_Port    GPIO_PORTB_BASE
#define Switch5_GPIO_Port    GPIO_PORTB_BASE

#define Switch1_PIN 	 GPIO_PIN_5
#define Switch2_PIN 	 GPIO_PIN_3
#define Switch3_PIN 	 GPIO_PIN_7
#define Switch4_PIN 	 GPIO_PIN_2
#define Switch5_PIN 	 GPIO_PIN_3

#define Switch1_On  GPIOPinWrite(Switch1_GPIO_Port, Switch1_PIN, Switch1_PIN)
#define Switch2_On  GPIOPinWrite(Switch2_GPIO_Port, Switch2_PIN, Switch2_PIN)
#define Switch3_On  GPIOPinWrite(Switch3_GPIO_Port, Switch3_PIN, Switch3_PIN)
#define Switch4_On  GPIOPinWrite(Switch4_GPIO_Port, Switch4_PIN, Switch4_PIN)
#define Switch5_On  GPIOPinWrite(Switch5_GPIO_Port, Switch5_PIN, Switch5_PIN)
#define Switch1_Off GPIOPinWrite(Switch1_GPIO_Port, Switch1_PIN, 0)
#define Switch2_Off GPIOPinWrite(Switch2_GPIO_Port, Switch2_PIN, 0)
#define Switch3_Off GPIOPinWrite(Switch3_GPIO_Port, Switch3_PIN, 0)
#define Switch4_Off GPIOPinWrite(Switch4_GPIO_Port, Switch4_PIN, 0)
#define Switch5_Off GPIOPinWrite(Switch5_GPIO_Port, Switch5_PIN, 0)

void buttons_init(void);
uint8_t buttons_read(void);
void Switch_Init(void);


